<!DOCTYPE html>
<html lang="pt-br">
    <head>
        <meta charset="utf-8">
        <link rel="stylesheet" type="text/css" href="style.css">
        <title> A import&acirc;cia do protocolo HTTP/S no cen&aacute;rio de programa&ccedil;&atilde;o.</title>
    </head>

    <body>
        <header> <div class="header">
            O protocolo HTTP e HTTPS na &aacute;rea da programa&ccedil;&atilde;o
        </div></header>

        <article>
            <p>O <i>Protocolo de Transferencia de Hipertexto</i> </p>
                <section><div class="section1">
                    O HTTP &eacute; um protocolo da camada de aplica&ccedil;&atilde;o onde sua principal fun&ccedil;&atilde;o &eacute; mandar uma "solicita&ccedil;&atilde;o" do cliente ao browser, e assim, trazer a informa&ccedil;&atilde;o solicitada. Esta informa&ccedil;&atilde;o por sua vez, vem toda fragmentada em varios peda&ccedil;os de codigo binario, e ent&atilde;o transformada em um arquivo HTML onde o browser poder&aacute; executa-la e ser vista pelo cliente.<br>
                    Apesar de ser o principal protocolo para comuni&ccedil;&atilde;o web, ele nunca vai funcionar sozinho. Junto a ele tempos o protocolo TCP - respons&aacute;vel pela transferencia das informa&ccedil;&otilde;es - e o IP -  cuida do encaminhamento dos dados enviados - que juntos, formam o modelo de comunica&ccedil;&atilde;o TCP/IP. <br>   
                </div></section>
            <p>Diferença entre o protocolo HTTP para o HTTPS</p>
                <section>
                    Embora atualmente não seja comum ser encontrado com frequ&ecirc;ncia, o HTTP se refere a uma versão mais antiga e menos segura do que o HTTPS. Isso se refere ao <i>S</i> da sigla, que condiz que as informa&ccedil;&otilde;es de busca e pesquisas na web, sejam criptografadas e privadas, com um auxilio de outro protocolo.<br>
                </section>
            <p>Sua comunica&ccedil;&atilde;o entre cliente e servidor</p>
                <section>
                    Sua comunica&ccedil;&atilde;o funcina da seguinte maneira: O request manda o pedido realizado pelo cliente ao servidor e o servidor manda sua resposta, chamado response, encerrando assim sua comunicação. Um detalhe que cada vez que realizar uma pesquisa ou atualizar a p&aacute;gina, um novo protocolo sera enviado e recebido.<br>
               </section>
            <p>Mas o por qu&ecirc; ele é importante no cenario de programa&ccedil;&atilde;o?</p>
               <section>
                Dentro do cen&aacute;rio de programadores de desenvolvimento web, esse &eacute; o principal protocolo a ser usado em todos seus projetos e pesquisas, ja que ele ser&aacute; respons&aacute;vel pela seguran&ccedil;a e privacidade dos clientes e servidores. <br>
               </section>
        <section> 
            <video src="HTTP.mp4" type="video/mp4" width="500px" height="300px" controls> </video>
                <br>Nesse video contem algumas informa&ccedil;&otilde;es a mais sobre o protocolo.<br>
            </div></section>
        <footer>
            <br>SENAI MG - Itabira.<br> Aluno Igor Paulo da Silva
        </footer>
    </body>
</html>
            
